In [1]:
import pandas as pd

In [3]:
df=[[100,200,300,400],[1000,2000,3000,4000]]

In [6]:
world_table_df=pd.DataFrame({'name':['afg','alb','alg','and','ango'],'contin':['asia','euro','afr','eur','afr']})

In [7]:
world_table_df

   name contin
0   afg   asia
1   alb   euro
2   alg    afr
3   and    eur
4  ango    afr

In [4]:
df=pd.DataFrame(df,columns=['A','B','C','D'])

In [5]:
df

      A     B     C     D
0   100   200   300   400
1  1000  2000  3000  4000

In [1]:
age_list = [['Afghanistan', 1952, 8425333, 'Asia'],
            ['Australia', 1957, 9712569, 'Oceania'],
            ['Brazil', 1962, 76039390, 'Americas'],
            ['China', 1957, 637408000, 'Asia'],
            ['France', 1957, 44310863, 'Europe'],
            ['India', 1952, 3.72e+08, 'Asia'],
            ['United States', 1957, 171984000, 'Americas']]

In [3]:
df = pd.DataFrame(age_list, columns=['Country', 'Year',
                                     'Population', 'Continent'])

In [4]:
df

         Country  Year   Population Continent
0    Afghanistan  1952    8425333.0      Asia
1      Australia  1957    9712569.0   Oceania
2         Brazil  1962   76039390.0  Americas
3          China  1957  637408000.0      Asia
4         France  1957   44310863.0    Europe
5          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas

In [12]:
df.sort_values(by=['Population'],ascending=[False])

         Country  Year   Population Continent
3          China  1957  637408000.0      Asia
5          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas
2         Brazil  1962   76039390.0  Americas
4         France  1957   44310863.0    Europe
1      Australia  1957    9712569.0   Oceania
0    Afghanistan  1952    8425333.0      Asia

In [10]:
df.sort_values(by=['Population'],ascending=False)

         Country  Year   Population Continent
3          China  1957  637408000.0      Asia
5          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas
2         Brazil  1962   76039390.0  Americas
4         France  1957   44310863.0    Europe
1      Australia  1957    9712569.0   Oceania
0    Afghanistan  1952    8425333.0      Asia

In [13]:
df.sort_index(axis=1,ascending=False)

   Year   Population        Country Continent
0  1952    8425333.0    Afghanistan      Asia
1  1957    9712569.0      Australia   Oceania
2  1962   76039390.0         Brazil  Americas
3  1957  637408000.0          China      Asia
4  1957   44310863.0         France    Europe
5  1952  372000000.0          India      Asia
6  1957  171984000.0  United States  Americas

In [14]:
left = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)

In [31]:
right = pd.DataFrame(
    {
        "key": ["K0", "K1"],
        "C": ["C0", "C1"],
        "D": ["D0", "D1"],
    }
)

In [33]:
#append is not present as part of dataframe object

In [32]:
left.append(right)

AttributeError: 'DataFrame' object has no attribute 'append'

In [21]:
pd.merge(left,right,how='left',on=['key'])

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2  NaN  NaN
3  K3  A3  B3  NaN  NaN

In [26]:
pd.concat([left,right],axis=0)

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3  NaN  NaN
0  K0  NaN  NaN   C0   D0
1  K1  NaN  NaN   C1   D1

In [27]:
pd.concat([left,right],axis=1)

  key   A   B  key    C    D
0  K0  A0  B0   K0   C0   D0
1  K1  A1  B1   K1   C1   D1
2  K2  A2  B2  NaN  NaN  NaN
3  K3  A3  B3  NaN  NaN  NaN

In [17]:
val=[3,6,8,10,1,2,1]

In [36]:
val[len(val)//2]

10

In [14]:
def quicksort(arr):
    print(arr)
    if len(arr) <= 1:
        return arr
    pivot = arr[len(arr) // 2]
    left = [x for x in arr if x < pivot]
    middle = [x for x in arr if x == pivot]
    right = [x for x in arr if x > pivot]
    print(left,middle,'***',right)
    return quicksort(left) + middle + quicksort(right)

#print(quicksort([3,6,8,10,1,2,1]))  # Output: [1, 1, 2, 3, 6, 8, 10]

In [15]:
val=quicksort(val)

[3, 6, 8, 10, 1, 2, 1]
[3, 6, 8, 1, 2, 1] [10] *** []
[3, 6, 8, 1, 2, 1]
[] [1, 1] *** [3, 6, 8, 2]
[]
[3, 6, 8, 2]
[3, 6, 2] [8] *** []
[3, 6, 2]
[3, 2] [6] *** []
[3, 2]
[] [2] *** [3]
[]
[3]
[]
[]
[]

In [4]:
val

[1, 1, 2, 3, 6, 8, 10]

In [16]:
def quicksort(array):
    if len(array)<=1:
        return array
    midpoint=array[len(array)//2]
    right=[x for x in array if x>midpoint]
    middle=[x for x in array if x==midpoint]
    left=[x for x in array if x<midpoint]
    return quicksort(right)+middle+quicksort(left)

In [18]:
val=quicksort(val)

In [19]:
val

[10, 8, 6, 3, 2, 1, 1]

In [39]:
def getdouble(nums,target):
    mydict={}
    i=0
    while i<len(nums):
        value=target-nums[i]
        if value in mydict:
            return [mydict[value],i]
        mydict[nums[i]]=i
        i+=1
    print(mydict)

In [40]:
nums = [3,2,4]

In [41]:
val=getdouble(nums,6)

In [42]:
val

[1, 2]

In [24]:
def getsubstr(input_str):
    length=0
    mydict={}
    r=0
    for i in range(len(input_str)):
        if input_str[i] in mydict:
            r=mydict[input_str[i]]+1
            
        else:
            length=max(length,i-r+1)
        print(mydict)
        mydict[input_str[i]]=i
    print(mydict)
    return length

In [23]:
input_str="pwwkew"
getsubstr(input_str)

{}
{'p': 0}
{'p': 0, 'w': 1}
{'p': 0, 'w': 2}
{'p': 0, 'w': 2, 'k': 3}
{'p': 0, 'w': 2, 'k': 3, 'e': 4}
{'p': 0, 'w': 5, 'k': 3, 'e': 4}

3

In [27]:
input_str="wwwwwww"
getsubstr(input_str)

{}
{'w': 0}
{'w': 1}
{'w': 2}
{'w': 3}
{'w': 4}
{'w': 5}
{'w': 6}

1

In [32]:
mydict={'bab':3}

In [33]:
val='bab'

In [34]:
if 'ab' in val:
    print(True)

True

In [35]:
if 'ab' in mydict:
    print(True)

In [72]:
mylist=[1,2,3]

In [77]:
mylist=[]

In [79]:
mylist.append(('test',2))

In [80]:
mylist

[('test', 2)]

In [82]:
mylist[0]=('jkj',4)

In [83]:
mylist

[('jkj', 4)]

In [89]:
def getpali(s):
    mydict=[]
    length=0
    for i in range(len(s)+1):
        for j in range(i+1,len(s)+1):
            val=s[i:j]
            if val==val[::-1]:
                if len(mydict)==0:
                    mydict.append((val,len(val)))
                else:
                    if mydict[-1][1]<len(val):
                        mydict[-1]=(val,len(val))
    return mydict.pop()[0]
    #return length

In [107]:
input_str='cbbd'

In [108]:
getpali2(input_str)

c
c
bb
bb

'bb'

In [111]:
def getpali2(s):
    mydict=''
    length=0
    for i in range(len(s)+1):
        for j in range(i+1,len(s)+1):
            val=s[i:j]
            if val==val[::-1]:
                if len(mydict)==0:
                    mydict=val
                else:
                    if len(mydict)<len(val):
                        mydict=val
    return mydict

In [112]:
# Employee table:
# +----+--------+
# | id | salary |
# +----+--------+
# | 1  | 100    |
# | 2  | 200    |
# | 3  | 300    |
# +----+--------+

In [114]:
import pandas as pd

In [146]:
df=[[1,100],[2,200],[3,300]]

In [147]:
df=pd.DataFrame(df,columns=['id','salary'])

In [119]:
df.shape

(3, 2)

In [120]:
df.describe()

        id  salary
count  3.0     3.0
mean   2.0   200.0
std    1.0   100.0
min    1.0   100.0
25%    1.5   150.0
50%    2.0   200.0
75%    2.5   250.0
max    3.0   300.0

In [132]:
df.head()

   id  salary
0   1     100
1   2     200
2   3     300

In [137]:
df.iloc[-1]

id          3
salary    300
Name: 2, dtype: int64

In [149]:
secondlarge=df.nlargest(2,columns='salary').iloc[-1] if len(df)>=2 else None

In [151]:
secondlarge['salary']

200

In [141]:
if secondlarge is None:
    print(pd.DataFrame({'SecondHighestSalary':[None]}))

In [152]:
df=pd.DataFrame({'SecondHighestSalary':[secondlarge['salary']]})

In [153]:
df

   SecondHighestSalary
0                  200

In [130]:
df.sort_values(by=['salary'],ascending=False,ignore_index=True)

   id  salary
0   3     300
1   2     200
2   1     100

In [8]:
t1=()

In [9]:
id(t1)

1899101241456

In [6]:
t1=t1+(1,2)

In [10]:
id(t1)

1899101241456

In [11]:
t2=()

In [16]:
id(t2)

1899101241456

In [13]:
myt1=()

In [17]:
id(myt1) is id(t2)

False

In [18]:
myt1=(1,2)

In [20]:
myt1

(1, 2)

In [23]:
myt1[1]=myt1[0]

TypeError: 'tuple' object does not support item assignment

In [41]:
data=[]
data=[1,0]

In [38]:
data=[(0,1)]

In [43]:
data[:0]

[]

In [3]:
#aabbcbddf
#desired output-> a2b2cb1d2f

In [31]:
data=[('a',1)]

In [32]:
len(data)

1

In [34]:
temp=data[len(data)-1]

In [51]:
mystr='aabbcbddf'
#string 
data=[]
for _ in mystr:
    if len(data)==0:
        data.append((_,1))
    else:
        temp=data[len(data)-1]
        if temp[0]==_:
            data[len(data)-1]=(_,temp[1]+1)
        else:
            data.append((_,1))

In [49]:
''.join([_[0]+str(_[1]) for _ in data])

'a2b2c1b1d2f1'

In [52]:
#roman to integer
roam2dict={
    'I':1,
    'V':5,
    'X':10,
    'L':50,
    'C':100,
    'D':500,
    'M':1000
}

In [82]:
def convertroman2int(s:str)->int:
    final_data=[]
    i=0
    if len(s)==1:
        final_data.append(roam2dict[s[0]])
    else:
        while i<len(s)-1:
            if roam2dict[s[i+1]]>roam2dict[s[i]]:
                final_data.append(roam2dict[s[i+1]]-roam2dict[s[i]])
                if i+2==len(s)-1:
                    final_data.append(roam2dict[s[i+2]])
                i+=2
                pass
            else:
                if i+1==len(s)-1:
                #final_data.append(roam2dict[input_data[i]])
                    final_data.append(roam2dict[s[i+1]])
                final_data.append(roam2dict[s[i]])
                i+=1
    print(final_data)
    print(sum(final_data))

In [80]:
input_data='MDCXCV'

In [83]:
convertroman2int(input_data)

[1000, 500, 100, 90, 5]
1695

In [52]:
mylist=['flower','flow','flight']

In [36]:
mylist=["flower","flower","flower","flower"]

In [39]:
mylist[-1]

'a'

In [60]:
mylist=["ab","a","db"]

In [40]:
mylist=["c","acc","ccc"]

In [61]:
sorted(mylist)

['a', 'ab', 'db']

In [109]:
base_str='flow'

In [116]:
base_str[0:1]

'f'

In [55]:
def get_longcommpref(mylist):
    mystr=""
    mylist=sorted(mylist)
    for i in range(min(len(mylist[0]),len(mylist[-1]))):
        if mylist[0][i]!=mylist[-1][i]:
            return mystr
        mystr+=mylist[0][i]
    print(mystr)
    return mystr

In [56]:
mystr=get_longcommpref(mylist)

In [57]:
mystr

'fl'

In [62]:
mydata=[[1,'Joe',7000,3],[2,'Henry',8000,4],[3,'Sam',6000,None],[4,'Max',9000,None]]

In [63]:
mydata

[[1, 'Joe', 7000, 3],
 [2, 'Henry', 8000, 4],
 [3, 'Sam', 6000, None],
 [4, 'Max', 9000, None]]

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame(mydata,columns=['id','name','salary','managerid'])

NameError: name 'mydata' is not defined

In [93]:
df.head()

   id   name  salary  managerid
0   1    Joe    7000        3.0
1   2  Henry    8000        4.0
2   3    Sam    6000        NaN
3   4    Max    9000        NaN

In [91]:
df['managerid']

0    3.0
1    4.0
2    NaN
3    NaN
Name: managerid, dtype: float64

In [95]:
test_df

0    3.0
1    4.0
2    NaN
3    NaN
Name: managerid, dtype: float64

In [97]:
df.merge(right=df,how='left',left_on='managerid',right_on='id')

   id_x name_x  salary_x  managerid_x  id_y name_y  salary_y  managerid_y
0     1    Joe      7000          3.0   3.0    Sam    6000.0          NaN
1     2  Henry      8000          4.0   4.0    Max    9000.0          NaN
2     3    Sam      6000          NaN   NaN    NaN       NaN          NaN
3     4    Max      9000          NaN   NaN    NaN       NaN          NaN

In [111]:
df=df.merge(df,how='left',left_on='managerid',right_on='id')

In [114]:
df.head()

   id_x name_x  salary_x  managerid_x  id_y name_y  salary_y  managerid_y
0     1    Joe      7000          3.0   3.0    Sam    6000.0          NaN
1     2  Henry      8000          4.0   4.0    Max    9000.0          NaN
2     3    Sam      6000          NaN   NaN    NaN       NaN          NaN
3     4    Max      9000          NaN   NaN    NaN       NaN          NaN

In [118]:
df=df[df['salary_x']>df['salary_y']]

In [120]:
df['name_x']

0    Joe
Name: name_x, dtype: object

In [121]:
pd.DataFrame({'Employee':df['name_x']})

  Employee
0      Joe

In [123]:
# Customers table:
# +----+-------+
# | id | name  |
# +----+-------+
# | 1  | Joe   |
# | 2  | Henry |
# | 3  | Sam   |
# | 4  | Max   |
# +----+-------+
# Orders table:
# +----+------------+
# | id | customerId |
# +----+------------+
# | 1  | 3          |
# | 2  | 1          |
# +----+------------+
#customers who never ordered

In [148]:
customers=pd.DataFrame({'id':[1,2,3,4],'name':['Joe','Henry','Sam','Max']})

In [149]:
orders=pd.DataFrame({'id':[1,2],'customerId':[3,1]})

In [130]:
orders.head(5)

   id  customerId
0   1           3
1   2           1

In [131]:
customers.head()

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [150]:
df=pd.merge(left=customers,right=orders,how='left',left_on='id',right_on='customerId')

In [147]:
df

   id_x   name  id_y  customerId
1     2  Henry   NaN         NaN
3     4    Max   NaN         NaN

In [151]:
df=df[df['customerId'].isnull()]['name']

In [153]:
pd.DataFrame({'Customers':df})

  Customers
1     Henry
3       Max

In [154]:
df

1    Henry
3      Max
Name: name, dtype: object

In [155]:
# Person table:
# +----+---------+
# | id | email   |
# +----+---------+
# | 1  | a@b.com |
# | 2  | c@d.com |
# | 3  | a@b.com |
# +----+---------+

In [191]:
#find duplicate emails
df=pd.DataFrame({'id':[1,2,3,4],'email':['a@b.com','c@d.com','a@b.com','c@d.com']})

In [192]:
df.head()

   id    email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com
3   4  c@d.com

In [175]:
df

   id    email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com

In [188]:
s=df.groupby(['email']).count()

In [198]:
df['email'].value_counts()[lambda x: x>1].index

Index(['a@b.com', 'c@d.com'], dtype='object', name='email')

In [200]:
pd.DataFrame({'Email':df['email'].value_counts()[lambda x: x>1].index})

     Email
0  a@b.com
1  c@d.com

In [183]:
s

         id
email
a@b.com   2
c@d.com   1

In [186]:
s[s>1]

          id
email
a@b.com  2.0
c@d.com  NaN

In [201]:
# Weather table:
# +----+------------+-------------+
# | id | recordDate | temperature |
# +----+------------+-------------+
# | 1  | 2015-01-01 | 10          |
# | 2  | 2015-01-02 | 25          |
# | 3  | 2015-01-03 | 20          |
# | 4  | 2015-01-04 | 30          |
# +----+------------+-------------+

In [18]:
df

   id  recordDate  temperature recordDate_diff
0   1  2015-01-01           10             NaT
1   2  2015-01-04           25          3 days
2   3  2015-01-03           20         -1 days
3   4  2015-01-02           30         -1 days

In [39]:
def gettempids(df:pd.DataFrame)->pd.DataFrame:
    df=df.sort_values(by='recordDate',ascending=True)
    df['recordDate_diff']=pd.to_datetime(df['recordDate']).diff()
    df['temp_diff']=df['temperature'].diff()
    return pd.DataFrame({'id':df.loc[(df['temp_diff']>=1) & (df['recordDate_diff']=='1 days'),'id']})

In [41]:
df=pd.DataFrame({'id':[1,2],'recordDate':['2015-01-01','2015-01-04'],'temperature':[10,25]})

In [42]:
df.head()

   id  recordDate  temperature
0   1  2015-01-01           10
1   2  2015-01-04           25

In [43]:
gettempids(df)

Empty DataFrame
Columns: [id]
Index: []

In [19]:
df=pd.DataFrame({'id':[1,2,3,4],'recordDate':['2015-01-01','2015-01-04','2015-01-03','2015-01-02'],'temperature':[10,25,20,30]})

In [21]:
df['recordDate_diff']=pd.to_datetime(df['recordDate']).diff()

In [22]:
df['temp_diff']=df['temperature'].diff()

In [20]:
df=df.sort_values(by='recordDate',ascending=True)

In [222]:
df[df['temp_diff']>1]

   id recordDate  temperature  temp_diff
1   2    2015-02           25       15.0
3   4    2015-04           30       10.0

In [34]:
df.loc[(df['recordDate_diff']=='1 days') & (df['temp_diff']>=1)]

   id  recordDate  temperature recordDate_diff  temp_diff
3   4  2015-01-02           30          1 days       20.0
1   2  2015-01-04           25          1 days        5.0

In [35]:
#df.loc[(df["B"] > 50) & (df["C"] != 900), "A"]
pd.DataFrame({'id':df.loc[(df['temp_diff']>=1) & (df['recordDate_diff']=='1 days'),'id']})

   id
3   4
1   2

In [29]:
df

   id  recordDate  temperature recordDate_diff  temp_diff
0   1  2015-01-01           10             NaT        NaN
3   4  2015-01-02           30          1 days       20.0
2   3  2015-01-03           20          1 days      -10.0
1   2  2015-01-04           25          1 days        5.0

In [44]:
#atleast five students

In [46]:
# Courses table:
# +---------+----------+
# | student | class    |
# +---------+----------+
# | A       | Math     |
# | B       | English  |
# | C       | Math     |
# | D       | Biology  |
# | E       | Math     |
# | F       | Computer |
# | G       | Math     |
# | H       | Math     |
# | I       | Math     |
# +---------+----------+

In [48]:
courses=pd.DataFrame({'student':['A','B','C','D','E','F'],'class':['math','eng','math','math','math','math']})

In [49]:
courses.head(7)

  student class
0       A  math
1       B   eng
2       C  math
3       D  math
4       E  math
5       F  math

In [53]:
courses.drop_duplicates(inplace=True)

In [54]:
courses['class'].value_counts()[lambda x:x>=5].index.values.tolist()

['math']

In [55]:
pd.DataFrame({'class':courses['class'].value_counts()[lambda x:x>=5].index.values.tolist()})

  class
0  math

In [56]:
# #| id | name  | salary | departmentId |
# +----+-------+--------+--------------+
# | 1  | Joe   | 70000  | 1            |
# | 2  | Jim   | 90000  | 1            |
# | 3  | Henry | 80000  | 2            |
# | 4  | Sam   | 60000  | 2            |
# | 5  | Max   | 90000  | 1            |
# +----+-------+--------+--------------+

In [57]:
# #+----+-------+
# | id | name  |
# +----+-------+
# | 1  | IT    |
# | 2  | Sales |
# +----+-------+

In [122]:
df=pd.DataFrame({'id':[1,2,3,4,5],'name':['Jo','Ji','He','Sa','Ma'],'salary':[7000,9000,8000,6000,9000],
             
'departmentId':[1,1,2,2,1]})

In [124]:
dept_df

   id   name
0   1     IT
1   2  Sales

In [128]:
df.merge(dept_df,left_on='departmentId',right_on='id',suffixes=['_employee','_dept'])

   id_employee name_employee  salary  departmentId  id_dept name_dept
0            1            Jo    7000             1        1        IT
1            2            Ji    9000             1        1        IT
2            5            Ma    9000             1        1        IT
3            3            He    8000             2        2     Sales
4            4            Sa    6000             2        2     Sales

In [4]:
df.head(6)

   id name  salary  departmentId
0   1   Jo    7000             1
1   2   Ji    9000             1
2   3   He    8000             2
3   4   Sa    6000             2
4   5   Ma    9000             1

In [5]:
df.groupby(['departmentId']).max()

              id name  salary
departmentId
1              5   Ma    9000
2              4   Sa    8000

In [89]:
df.head()

   id name  salary  departmentId
0   1   Jo    7000             1
1   2   Ji    9000             1
2   3   He    8000             2
3   4   Sa    6000             2
4   5   Ma    9000             1

In [88]:
df[df.salary == df.salary.max()].index

Index([1, 4], dtype='int64')

In [86]:
df.groupby(['departmentId'])

   id name  salary
0   5   Ma    9000
1   5   Ma    9000
2   4   Sa    8000
3   4   Sa    8000
4   5   Ma    9000

In [83]:
df.groupby(['departmentId','name'])['salary'].agg('max')

departmentId  name
1             Ji      9000
              Jo      7000
              Ma      9000
2             He      8000
              Sa      6000
Name: salary, dtype: int64

In [7]:
df['salary'].groupby(df['departmentId']).max()

departmentId
1    9000
2    8000
Name: salary, dtype: int64

In [24]:
test_df=pd.DataFrame({'salary':df['salary'].groupby(df['departmentId']).max()})

In [88]:
dept_df=pd.DataFrame({'id':[1,2],'name':['IT','Sales']})

In [90]:
dept_df

   id   name
0   1     IT
1   2  Sales

In [123]:
df

   id name  salary  departmentId
0   1   Jo    7000             1
1   2   Ji    9000             1
2   3   He    8000             2
3   4   Sa    6000             2
4   5   Ma    9000             1

In [106]:
merged_df=df.merge(dept_df,left_on='departmentId',right_on='id',suffixes=('_employee','_dept'))

In [ ]:
#    highest_salary_df = merged_df.groupby('departmentId').apply(lambda x: x[x['salary'] == x['salary'].max()])

In [112]:
highest_df=merged_df.groupby(['departmentId']).apply(lambda x:x[x['salary']==x['salary'].max()])

In [115]:
highest_df=highest_df.reset_index(drop=True)

In [118]:
highest_df=highest_df[['name_dept','name_employee','salary']]

In [119]:
highest_df.columns=[['Department','Employee','Salary']]

In [121]:
highest_df

  Department Employee Salary
0         IT       Ji   9000
1         IT       Ma   9000
2      Sales       He   8000

In [100]:
pd.merge(df, dept_df, how="left", on=["departmentId", "id"])

KeyError: 'departmentId'

In [105]:
df.merge(right=df,left_on=['departmentId'],right_on=['id'],how='left')

,id_x,name_x,salary_x,departmentId_x,id_y,name_y,salary_y,departmentId_y
0,1,Jo,7000,1,1,Jo,7000,1
1,2,Ji,9000,1,1,Jo,7000,1
2,3,He,8000,2,2,Ji,9000,1
3,4,Sa,6000,2,2,Ji,9000,1
4,5,Ma,9000,1,1,Jo,7000,1

In [86]:
# #Department table:
# +----+-------+
# | id | name  |
# +----+-------+
# | 1  | IT    |
# | 2  | Sales |
# +----+-------+

In [38]:
test_df

              salary
departmentId
1               9000
2               8000

In [39]:
test_df['salary'][2]

8000

In [36]:
df.loc[(df['salary'])>5000]

   id name  salary  departmentId    test
0   1   Jo    7000             1     NaN
1   2   Ji    9000             1  9000.0
2   3   He    8000             2  8000.0
3   4   Sa    6000             2     NaN
4   5   Ma    9000             1     NaN

In [13]:
df['test']=df['salary'].groupby(df['departmentId']).max()

In [41]:
df

   id name  salary  departmentId    test
0   1   Jo    7000             1     NaN
1   2   Ji    9000             1  9000.0
2   3   He    8000             2  8000.0
3   4   Sa    6000             2     NaN
4   5   Ma    9000             1     NaN

In [63]:
df.head()

   id name  salary  departmentId    test
0   1   Jo    7000             1     NaN
1   2   Ji    9000             1  9000.0
2   3   He    8000             2  8000.0
3   4   Sa    6000             2     NaN
4   5   Ma    9000             1     NaN

In [64]:
test_df

              salary
departmentId
1               9000
2               8000

In [65]:
test_df['salary'][df['departmentId']]

departmentId
1    9000
1    9000
2    8000
2    8000
1    9000
Name: salary, dtype: int64

In [67]:
df['test']

0       NaN
1    9000.0
2    8000.0
3       NaN
4       NaN
Name: test, dtype: float64

In [72]:
df

   id name  salary  departmentId    test
0   1   Jo    7000             1     NaN
1   2   Ji    9000             1  9000.0
2   3   He    8000             2  8000.0
3   4   Sa    6000             2     NaN
4   5   Ma    9000             1     NaN

In [85]:
df.loc[df['salary']==test_df['salary'][1],['name']]

  name
1   Ji
4   Ma

In [ ]:
df.loc[df['salary']==test_df['salary'][1],['name']]

In [52]:
test_df['salary'][df['departmentId']]

departmentId
1    9000
1    9000
2    8000
2    8000
1    9000
Name: salary, dtype: int64

In [1]:
import pandas as pd

In [4]:
#https://leetcode.com/problems/department-highest-salary/description/?lang=pythondata

Input: 
Employee table:
+----+-------+--------+--------------+
| id | name  | salary | departmentId |
+----+-------+--------+--------------+
| 1  | Joe   | 70000  | 1            |
| 2  | Jim   | 90000  | 1            |
| 3  | Henry | 80000  | 2            |
| 4  | Sam   | 60000  | 2            |
| 5  | Max   | 90000  | 1            |
+----+-------+--------+--------------+
Department table:
+----+-------+
| id | name  |
+----+-------+
| 1  | IT    |
| 2  | Sales |
+----+-------+

In [31]:
employee_df=pd.DataFrame({'id':[1,2,3,4,5],'name':['Joe','Jim','hen','sam','max'],'salary':[70000,90000,80000,60000,90000],'departmentId':[1,1,2,2,1]})

In [7]:
employee_df

   id name  salary  departmentId
0   1  Joe   70000             1
1   2  Jim   90000             1
2   3  hen   80000             2
3   4  sam   60000             2
4   5  max   90000             1

In [32]:
department_df=pd.DataFrame({'id':[1,2],'name':['IT','Sales']})

In [10]:
department_df

   id   name
0   1     IT
1   2  Sales

In [36]:
merged_df=pd.merge(left=employee_df,right=department_df,left_on='departmentId',right_on='id',how='left')

In [37]:
merged_df

   id_x name_x  salary  departmentId  id_y name_y
0     1    Joe   70000             1     1     IT
1     2    Jim   90000             1     1     IT
2     3    hen   80000             2     2  Sales
3     4    sam   60000             2     2  Sales
4     5    max   90000             1     1     IT

In [41]:
merged_df=merged_df.groupby(['name_y']).apply(lambda x:x[x['salary']==x['salary'].max()])

In [43]:
merged_df.reset_index(drop=True)

   id_x name_x  salary  departmentId  id_y name_y
0     2    Jim   90000             1     1     IT
1     5    max   90000             1     1     IT
2     3    hen   80000             2     2  Sales

In [15]:
merged_df=employee_df.merge(department_df,left_on='departmentId',right_on='id',suffixes=['_employee','_depart'])

In [16]:
merged_df

   id_employee name_employee  salary  departmentId  id_depart name_depart
0            1           Joe   70000             1          1          IT
1            2           Jim   90000             1          1          IT
2            5           max   90000             1          1          IT
3            3           hen   80000             2          2       Sales
4            4           sam   60000             2          2       Sales

In [19]:
highest_df=merged_df.groupby(['name_depart']).apply(lambda x:x[x['salary']==x['salary'].max()])

In [23]:
highest_df.reset_index(drop=True,inplace=True)

In [24]:
highest_df

   id_employee name_employee  salary  departmentId  id_depart name_depart
0            2           Jim   90000             1          1          IT
1            5           max   90000             1          1          IT
2            3           hen   80000             2          2       Sales

In [26]:
highest_df=highest_df[['name_employee','salary','name_depart']]

In [27]:
highest_df

  name_employee  salary name_depart
0           Jim   90000          IT
1           max   90000          IT
2           hen   80000       Sales

In [29]:
highest_df.rename(columns = {'name_depart':'Department_name','name_employee':'Employee_name'}, inplace = True)

C:\Users\LAXMAN\AppData\Local\Temp\ipykernel_12156\229774880.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  highest_df.rename(columns = {'name_depart':'Department_name','name_employee':'Employee_name'}, inplace = True)

In [30]:
highest_df

  Employee_name  salary Department_name
0           Jim   90000              IT
1           max   90000              IT
2           hen   80000           Sales

In [45]:
# Employee table:
# +----+-------+--------+--------------+
# | id | name  | salary | departmentId |
# +----+-------+--------+--------------+
# | 1  | Joe   | 85000  | 1            |
# | 2  | Henry | 80000  | 2            |
# | 3  | Sam   | 60000  | 2            |
# | 4  | Max   | 90000  | 1            |
# | 5  | Janet | 69000  | 1            |
# | 6  | Randy | 85000  | 1            |
# | 7  | Will  | 70000  | 1            |
# +----+-------+--------+--------------+
# Department table:
# +----+-------+
# | id | name  |
# +----+-------+
# | 1  | IT    |
# | 2  | Sales |
# +----+-------+

In [64]:
df=pd.DataFrame({'id':[1,2,3,4,5,6,7],'name':['Joe','Henry','Sam','Max','Janet','Randy','Will'],'salary':[85000,80000,60000,90000,69000,85000,70000],'departmentId':[1,2,2,1,1,1,1]})

In [50]:
df.head()

   id   name  salary  departmentId
0   1    Joe   85000             1
1   2  Henry   80000             2
2   3    Sam   60000             2
3   4    Max   90000             1
4   5  Janet   69000             1

In [65]:
dept_df=pd.DataFrame({'id':[1,2],'name':['IT','Sales']})

In [66]:
merged_df=pd.merge(df,dept_df,left_on='departmentId',right_on='id',how='left',suffixes=['_empl','_depart'])

In [67]:
merged_df

   id_empl name_empl  salary  departmentId  id_depart name_depart
0        1       Joe   85000             1          1          IT
1        2     Henry   80000             2          2       Sales
2        3       Sam   60000             2          2       Sales
3        4       Max   90000             1          1          IT
4        5     Janet   69000             1          1          IT
5        6     Randy   85000             1          1          IT
6        7      Will   70000             1          1          IT

In [96]:
#df.groupby('State')['Population'].apply(lambda grp: grp.nlargest(2).sum())

In [121]:
merged_df

   id_empl name_empl  salary  departmentId  id_depart name_depart
0        1       Joe   85000             1          1          IT
1        2     Henry   80000             2          2       Sales
2        3       Sam   60000             2          2       Sales
3        4       Max   90000             1          1          IT
4        5     Janet   69000             1          1          IT
5        6     Randy   85000             1          1          IT
6        7      Will   70000             1          1          IT

In [127]:
merged_df

,id_empl,name_empl,salary,departmentId,id_depart,name_depart,rank_based_sal
0,1,Joe,85000,1,1,IT,2.0
1,2,Henry,80000,2,2,Sales,1.0
2,3,Sam,60000,2,2,Sales,2.0
3,4,Max,90000,1,1,IT,1.0
4,5,Janet,69000,1,1,IT,4.0
5,6,Randy,85000,1,1,IT,2.0
6,7,Will,70000,1,1,IT,3.0

In [123]:
merged_df['rank_based_sal']=merged_df.groupby("name_depart")["salary"].rank(method="dense", ascending=False)

In [135]:
merged_df=merged_df.loc[merged_df['rank_based_sal']<=3]

In [136]:
merged_df

,id_empl,name_empl,salary,departmentId,id_depart,name_depart,rank_based_sal
0,1,Joe,85000,1,1,IT,2.0
1,2,Henry,80000,2,2,Sales,1.0
2,3,Sam,60000,2,2,Sales,2.0
3,4,Max,90000,1,1,IT,1.0
5,6,Randy,85000,1,1,IT,2.0
6,7,Will,70000,1,1,IT,3.0

In [147]:
merged_df=merged_df[['name_empl','salary','name_depart']].rename(columns={'name_depart':'Department','name_empl':'Employee'})

In [148]:
merged_df

  Employee  salary Department
0      Joe   85000         IT
1    Henry   80000      Sales
2      Sam   60000      Sales
3      Max   90000         IT
5    Randy   85000         IT
6     Will   70000         IT

In [102]:
grouped_df=merged_df.groupby('name_depart').apply(lambda salary:salary['salary'].nlargest(3)).reset_index()

In [105]:
grouped_df

  name_depart  level_1  salary
0          IT        3   90000
1          IT        0   85000
2          IT        5   85000
3       Sales        1   80000
4       Sales        2   60000

In [108]:
merged_df

   id_empl name_empl  salary  departmentId  id_depart name_depart
0        1       Joe   85000             1          1          IT
1        2     Henry   80000             2          2       Sales
2        3       Sam   60000             2          2       Sales
3        4       Max   90000             1          1          IT
4        5     Janet   69000             1          1          IT
5        6     Randy   85000             1          1          IT
6        7      Will   70000             1          1          IT

In [118]:
final_df=pd.merge(grouped_df,merged_df,on='salary',how='left').drop(['level_1'],axis=1).drop_duplicates(keep='first')

In [119]:
final_df

,name_depart_x,salary,id_empl,name_empl,departmentId,id_depart,name_depart_y
0,IT,90000,4,Max,1,1,IT
1,IT,85000,1,Joe,1,1,IT
2,IT,85000,6,Randy,1,1,IT
5,Sales,80000,2,Henry,2,2,Sales
6,Sales,60000,3,Sam,2,2,Sales

In [120]:
final_df[['name_depart_y','name_empl','salary']]

  name_depart_y name_empl  salary
0            IT       Max   90000
1            IT       Joe   85000
2            IT     Randy   85000
5         Sales     Henry   80000
6         Sales       Sam   60000

In [149]:
# #Employee table:
# +----+--------+
# | id | salary |
# +----+--------+
# | 1  | 100    |
# | 2  | 200    |
# | 3  | 300    |
# +----+--------+

In [233]:
employee=pd.DataFrame({'id':[1,2,3],'salary':[100,200,300]})

In [212]:
# #Employee table:
# +----+--------+
# | id | salary |
# +----+--------+
# | 1  | 100    |
# +----+--------+

In [246]:
employee=pd.DataFrame({'id':[1,2],'salary':[100,200]})

In [247]:
employee.shape

(2, 2)

In [248]:
if employee.shape[0]<2:
    mytest=pd.DataFrame({'SecondHighestSalary':[None]})

In [249]:
mytest

  SecondHighestSalary
0                null

In [255]:
sorted(employee['salary'].unique(),reverse=True)

[200, 100]

In [234]:
employee

   id  salary
0   1     100
1   2     200
2   3     300

In [241]:
sorted(employee['salary'].unique())[1]

200

In [ ]:
if len(employee['salary'].unique())<2:
    print(True)
else:
    employee['salary'].unique()

In [232]:
employee

   id  salary
0   1     100

In [207]:
employee.nlargest(n=2,columns='salary').iloc[::1]['salary'][1]

200

In [214]:
pd.DataFrame({'nlargest':[employee.nlargest(n=2,columns='salary').iloc[::1]['salary'][1]]})

KeyError: 1

In [203]:
pd.DataFrame({'nlargest':employee.sort_values(by=['salary'],ascending=False).nlargest(n=2,columns='salary').iloc[1]})

        nlargest
id             2
salary       200

In [ ]:
merged_df['rank_based_sal']=merged_df.groupby("name_depart")["salary"].rank(method="dense", ascending=False)

In [158]:
employee.groupby('salary')[].rank(method="dense",ascending=False)

    id
0  1.0
1  1.0
2  1.0

In [175]:
employee['salary'].nlargest(n=2).iloc[::-1][1]

200

In [1]:
mydict={}

In [2]:
mydict[1,2,3]=''

In [3]:
mydict[2,3,4]=''

In [5]:
mydict[1,2,3]=''

In [6]:
mydict

{(1, 2, 3): '', (2, 3, 4): ''}

In [74]:
def test3sum(nums):
    target=0
    triplet_dict={}
    #sort the array
    nums=sorted(nums)
    i=0
    while i<len(nums)-2:
        #two pointer starts here
        left=i+1
        right=len(nums)-1
        print(i)
        #for j in range(i,last_index):
        while left<right:
            #print(left,right,'**left,right')
            #print(nums[j])
            value_triplet=nums[i]+nums[left]+nums[right]
            print(value_triplet,'***',nums[i],nums[left],nums[right])
            if value_triplet==0:
                triplet_dict[nums[i],nums[left],nums[right]]=''
                #print(triplet_dict)
                #print(left,right,'**left,rightber')
                left+=1
                right-=1
                #print(left,right,'**left,rightafter')
            elif value_triplet<0:
                left+=1
            else:
                right-=1
        i+=1
    return list(triplet_dict.keys())
    print(triplet_dict) 
    print()

In [19]:
sorted(nums)

[-4, -1, -1, 0, 1, 2]

In [60]:
nums=[-1,0,1,2,-1,-4]

In [73]:
test3sum(nums)

0
-3 *** -4 -1 2
-3 *** -4 -1 2
-2 *** -4 0 2
-1 *** -4 1 2
1
0 *** -1 -1 2
0 *** -1 0 1
2
1 *** -1 0 2
0 *** -1 0 1
3
3 *** 0 1 2
{(-1, -1, 2): '', (-1, 0, 1): ''}
[(-1, -1, 2), (-1, 0, 1)]

In [1]:
import pandas as pd

In [55]:
def consecutive_numbers(df: pd.DataFrame) -> pd.DataFrame:
    df['num_diff']=df['num'].diff()
    df['num_diff'].fillna(0,inplace=True)
    df['num_diff']=df['num_diff'].apply(int)
    df=df.groupby(['num']).apply(lambda x:x[x['num_diff']==0]).reset_index(drop=True)
    df['id_diff']=df['id'].diff()
    df.fillna(1,inplace=True)
    df=df.loc[(df['id_diff']==1)].groupby(['num']).sum().reset_index(drop=False)
    return pd.DataFrame({'ConsecutiveNums':df.loc[(df['id_diff']==3.0),'num']})

In [ ]:
# #| id | num |
# | -- | --- |
# | 1  | 9   |
# | 2  | 9   |
# | 3  | 9   |
# | 4  | 8   |
# | 5  | 8   |
# | 6  | 8   |

In [93]:
df=pd.DataFrame({'id':[1,2,3,4,5,6],'num':[9,9,9,8,8,8]})

In [3]:
df.head()

   id  num
0   1    9
1   2    9
2   3    9
3   4    8
4   5    8

In [87]:
df=pd.DataFrame({'id':[1,2,3,4,5,6],'num':[1,1,1,2,1,2]})

In [59]:
df

   id  num
0   1    1
1   2    1
2   3    1
3   4    2
4   5    1
5   6    2

In [44]:
nums=

In [57]:
# df=df[df.groupby('num')['id'].transform('count').ge(3)]
#     df=df.sort_values(by=['num'])
#     df['num_diff']=df['num'].diff()
#     df['num_diff'].fillna(0,inplace=True)
#     df['num_diff']=df['num_diff'].apply(int)
#     df=df.groupby(['num']).apply(lambda x:x[x['num_diff']==0]).reset_index(drop=True)
#     df['id_new']=df.index
#     df['id_diff']=df['id_new'].diff()
#     df.fillna(1,inplace=True)
#     df=df.loc[(df['id_diff']==1)].groupby(['num']).sum().reset_index(drop=False)
#     return pd.DataFrame({'ConsecutiveNums':df.loc[(df['id_diff']>=3.0),'num']})
#didnt work

In [94]:
nums=df['num'].values.tolist()

In [98]:
nums[2:]

[9, 8, 8, 8]

In [99]:
ans = sorted(set(trip[0] for trip in zip(nums,nums[1:],nums[2:]) if len(set(trip)) == 1))
ans

[8, 9]

In [96]:
for trip in zip(nums,nums[1:],nums[2:]):
    print(trip)

(9, 9, 9)
(9, 9, 8)
(9, 8, 8)
(8, 8, 8)

In [79]:
consective=[]
t1=()
for _ in df.values.tolist():
    if len(t1)>0 and  _[1]==t1[0]:
            temp=t1[1]
            #print(temp,t1)
            temp+=1
            t1=(_[1],temp)
    else:
        print(t1)
        if len(t1)>0 and t1[1]>=3:
            consective.append(t1[0])
        t1=()
        t1=(_[1],1)
        print(t1)
print(t1)
if len(t1)>0 and t1[1]>=3:
    consective.append(t1[0])

()
(1, 1)
(1, 3)
(2, 1)
(2, 1)
(1, 1)
(1, 1)
(2, 1)
(2, 1)

In [64]:
t1

(2, 3)

In [80]:
consective

[1]

In [27]:
for trip in zip(nums,nums[1:],nums[2:]):
    print(trip)

([1, 1], [2, 1], [3, 3])
([2, 1], [3, 3], [4, 3])
([3, 3], [4, 3], [5, 3])

In [74]:
df=df.sort_values(by=['num'])
#df.reset_index(drop=True)

In [107]:
df

   id  num
0   1    1
1   2    1
2   3    3
3   4    3
4   5    3

In [115]:
df[df.groupby('num')['id'].transform('count').ge(3)]

   id  num
2   3    3
3   4    3
4   5    3

In [5]:
df

   id  num  num_diff
3   4    8       0.0
4   5    8       0.0
5   6    8       0.0
0   1    9       1.0
1   2    9       0.0
2   3    9       0.0

In [21]:
# | id | num |
# | -- | --- |
# | 1  | 1   |
# | 2  | 1   |
# | 3  | 1   |
# | 4  | 2   |
# | 5  | 1   |
# | 6  | 2   |

In [22]:
df=pd.DataFrame({'id':[1,2,3,4,5,6],'num':[1,1,1,2,1,2]})

In [23]:
df=df[df.groupby('num')['id'].transform('count').ge(3)]
df

   id  num
0   1    1
1   2    1
2   3    1
4   5    1

In [ ]:
df['num']

In [20]:
df=df[df.groupby('num')['id'].transform('count').ge(3)]
df
df=df.sort_values(by=['num'])
df['num_diff']=df['num'].diff()
df
df['num_diff'].fillna(0,inplace=True)
df
# # df['num_diff']=df['num_diff'].apply(int)
df=df.groupby(['num']).apply(lambda x:x[x['num_diff']<=1]).reset_index(drop=True)
df['id_new']=df.index
df['id_diff']=df['id_new'].diff()
df.fillna(1,inplace=True)
df
df=df.loc[(df['id_diff']==1)].groupby(['num']).sum().reset_index(drop=False)
df
pd.DataFrame({'ConsecutiveNums':df.loc[(df['id_diff']==3.0),'num']})

   ConsecutiveNums
0                8
1                9

In [15]:
df['id_new']=df.index

In [16]:
df

   id  num  num_diff  id_diff  id_new
0   4    8       0.0      1.0       0
1   5    8       0.0      1.0       1
2   6    8       0.0      1.0       2
3   1    9       1.0     -5.0       3
4   2    9       0.0      1.0       4
5   3    9       0.0      1.0       5

In [97]:
df=df[df.groupby('num')['id'].transform('count').ge(2)]

In [ ]:
df['email'].value_counts()[lambda x: x>1].index

In [83]:
df['num'].value_counts()[lambda x:x>=3]

Index([0], dtype='int64', name='num')

In [79]:
df.drop(df['num'].value_counts()[lambda x: x>=3])

   id  num
0   1    1
1   2    0
2   3    0

In [75]:
df['num_diff']=df['num'].diff()
df
df['num_diff'].fillna(0,inplace=True)
df
#df['num_diff']=df['num_diff'].apply(int)
df
df=df.groupby(['num']).apply(lambda x:x[x['num_diff']==0]).reset_index(drop=True)
df['id_diff']=df['id'].diff()
df.fillna(1,inplace=True)
df=df.loc[(df['id_diff']==1)].groupby(['num']).sum().reset_index(drop=False)

In [76]:
pd.DataFrame({'ConsecutiveNums':df.loc[(df['id_diff']==3.0),'num']})

   ConsecutiveNums
0                0

In [ ]:
# | id | num |
# | -- | --- |
# | 1  | 1   |
# | 2  | 0   |
# | 3  | 0   |
# | 4  | 0   |

In [2]:
# #Logs table:
# +----+-----+
# | id | num |
# +----+-----+
# | 1  | 1   |
# | 2  | 1   |
# | 3  | 1   |
# | 4  | 2   |
# | 5  | 1   |
# | 6  | 2   |
# | 7  | 2   |
# +----+-----+

In [4]:
df=pd.DataFrame({'id':[1,2,3,4,5,6,7],'num':[1,1,1,2,1,2,2]})

In [9]:
df['num_diff']=df['num'].diff()

In [18]:
df

   id  num  num_diff
0   1    1       0.0
1   2    1       0.0
2   3    1       0.0
3   4    2       1.0
4   5    1      -1.0
5   6    2       1.0
6   7    2       0.0

In [17]:
df['num_diff'].fillna(0,inplace=True)

In [22]:
df['num_diff']=df['num_diff'].apply(int)

In [23]:
df

   id  num  num_diff
0   1    1         0
1   2    1         0
2   3    1         0
3   4    2         1
4   5    1        -1
5   6    2         1
6   7    2         0

In [27]:
df=df.groupby(['num']).apply(lambda x:x[x['num_diff']==0]).reset_index(drop=True)

In [29]:
df['id_diff']=df['id'].diff()

In [32]:
df.fillna(1,inplace=True)

In [34]:
df

   id  num  num_diff  id_diff
0   1    1         0      1.0
1   2    1         0      1.0
2   3    1         0      1.0
3   7    2         0      4.0

In [51]:
df=df.loc[(df['id_diff']==1)].groupby(['num']).sum().reset_index(drop=False)

In [52]:
df

   num  id  num_diff  id_diff
0    1   6         0      3.0

In [54]:
pd.DataFrame({'ConsecutiveNums':df.loc[(df['id_diff']==3.0),'num']})

   ConsecutiveNums
0                1

In [ ]:
highest_df=merged_df.groupby(['departmentId']).apply(lambda x:x[x['salary']==x['salary'].max()])

In [8]:
df['id'].diff()

0    NaN
1    1.0
2    1.0
3    1.0
4    1.0
5    1.0
6    1.0
Name: id, dtype: float64

In [10]:
# A country is big if:

# it has an area of at least three million (i.e., 3000000 km2), or
# it has a population of at least twenty-five million (i.e., 25000000).
# Write a solution to find the name, population, and area of the big countries.

# Return the result table in any order.

# The result format is in the following example.

In [8]:
world_table_df=pd.DataFrame({'name':['afg','alb','alg','and','ango'],'contin':['asia','euro','afr','eur','afr'],
                            'area':[652230,28748,2381741,468,1246700],'popul':[25500100,2831741,37100000,78115,2060924]
                            })

In [9]:
world_table_df

   name contin     area     popul
0   afg   asia   652230  25500100
1   alb   euro    28748   2831741
2   alg    afr  2381741  37100000
3   and    eur      468     78115
4  ango    afr  1246700   2060924

In [ ]:
#['rebounds', 'points']

In [16]:
world_table_df.loc[(world_table_df['popul']>=25000000) | (world_table_df['area']>=3000000),['name','area']]

  name     area
0  afg   652230
2  alg  2381741

In [ ]:
# Customer table:
# +----+------+------------+
# | id | name | referee_id |
# +----+------+------------+
# | 1  | Will | null       |
# | 2  | Jane | null       |
# | 3  | Alex | 2          |
# | 4  | Bill | null       |
# | 5  | Zack | 1          |
# | 6  | Mark | 2          |
# +----+------+------------+
# Output: 
# +------+
# | name |
# +------+
# | Will |
# | Jane |
# | Bill |
# | Zack |
# +------+

In [25]:
df=pd.DataFrame({'id':[1,2,3,4,5,6],'name':['will','j','al','bil','za',''],'referee_id':['null','null',2,'null',1,2]})

In [26]:
df

   id  name referee_id
0   1  will       null
1   2     j       null
2   3     k          2
3   4     l       null
4   5     m          1
5   6     n          2

In [27]:
df.loc[(df['referee_id']!=2),['name']]

   name
0  will
1     j
3     l
4     m

In [1]:
#valid_anagram

In [3]:
nums1=[1,3]

In [4]:
nums2=[2]

In [11]:
merged_array=[]

In [9]:
merged_array.append(nums2)

In [14]:
sorted(merged_array.extend(nums2))

In [16]:
merged_array=sorted(merged_array)

In [17]:
merged_array

[1, 2, 3]

In [27]:
merged_array=[1,2,3,4]

In [30]:
if len(merged_array)%2==0:
    print(merged_array[len(merged_array)//2+(len(merged_array)//2)-1]/2)
    pass
else:
    print(merged_array[len(merged_array)//2])

2.0